Revit 2027 API
Generic.GenericBumpAmount Property
 The property labeled "Amount" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GenericBumpAmount { get; }
Public Shared ReadOnly Property GenericBumpAmount As String
	Get
public:
static property String^ GenericBumpAmount {
	String^ get ();
}
static member GenericBumpAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "-1000, 1000".
See Also
Reference
Generic Class
Autodesk.Revit.DB.Visual Namespace